[
    {
        "id": 228915,
        "file_name": "COCO_train2014_000000228915.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000228915.jpg",
        "captions": [
            "A lady wearing a ring and two bracelets holds a gray cat.",
            "An uncomfortable looking cat wearing a tight white fabric collar",
            "Someone holding a grey cat that has been shaved. ",
            "A dark gray cat with shaved fur is held by a woman.",
            "a cat with a collar sitting by a woman"
        ]
    },
    {
        "id": 280866,
        "file_name": "COCO_train2014_000000280866.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000280866.jpg",
        "captions": [
            "A person crossing their legs while a cat walks against a wall.",
            "a person wearing red tennis shoes and a black cat",
            "Person with red tennis shoes with feet up near black cat.",
            "A person's feet in red shoes next to a black cat.",
            "A black cat walking a ledge in a dark room."
        ]
    },
    {
        "id": 467333,
        "file_name": "COCO_train2014_000000467333.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000467333.jpg",
        "captions": [
            "A fluffy cat laying on the arm of a couch.",
            "A black and white photo of a cat with a remote control.",
            "A cat is laying on the couch arm by a remote control.",
            "A cat is sitting on the arm of a chair with a remote.",
            "A cat sitting on a couch arm next to a remote control."
        ]
    },
    {
        "id": 476960,
        "file_name": "COCO_train2014_000000476960.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000476960.jpg",
        "captions": [
            "A cat standing with a banana in its mouth.",
            "There is a cat that is trying to eat a banana",
            "a house cat playing with a ripe banana",
            "A cat with a banana in its mouth.",
            "The cat has the banana in his mouth."
        ]
    },
    {
        "id": 118960,
        "file_name": "COCO_train2014_000000118960.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000118960.jpg",
        "captions": [
            "A couple of men standing next to each other near a parking lot.",
            "Two men standing near a parked car having a conversation.",
            "Some guys standing on a side walk by a car.",
            "Two people standing on the sidewalk, one with a backpack that has a cat inside it.",
            "Two men have a conversation on a sidewalk."
        ]
    },
    {
        "id": 271112,
        "file_name": "COCO_train2014_000000271112.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000271112.jpg",
        "captions": [
            "A multi-colored cat laying on a rug next to some bottles and a glass door.",
            "A cat sitting on the floor looking up",
            "The cat looks upward beside some glass bottles.",
            "A very cute cat on a rug by some bottles.",
            "Multi colored cat laying on the floor next to door and liquor bottles"
        ]
    },
    {
        "id": 89848,
        "file_name": "COCO_train2014_000000089848.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000089848.jpg",
        "captions": [
            "A cat sitting in a sink over a cup of something.",
            "A tortoiseshell cat stands in a stainless steel sink and drinks from a cup.",
            "A cat looking up while sipping from a cup in a sink.",
            "A very cute cat sitting in a sink drinking from a cup.",
            "furry cat drinking from a paper cup inside a kitchen sink"
        ]
    },
    {
        "id": 320045,
        "file_name": "COCO_train2014_000000320045.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000320045.jpg",
        "captions": [
            "A cat sits on a wooden chair with a purse.",
            "A cat sitting on a wooden chair next to table.",
            "A cat sitting on a chair in a restaurant",
            "A cat sits on a cafe chair with a handbag",
            "Grey and white cat sitting on top of a wooden chair. "
        ]
    },
    {
        "id": 386884,
        "file_name": "COCO_train2014_000000386884.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000386884.jpg",
        "captions": [
            "A cat is hiding under a blanket and peering out.",
            "A black cat hiding under a blue blanket.",
            "A cat looks out from under a blue blanket.",
            "There is a cat lying under a blanket",
            "a cat looking out from underneath a blanket."
        ]
    },
    {
        "id": 41505,
        "file_name": "COCO_train2014_000000041505.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000041505.jpg",
        "captions": [
            "A cat is laying on top of a laptop computer.",
            "A cat taking a nap on a laptop.",
            "A ginger cat resting on a PC laptop",
            "A brown cat napping on a laptop kept on a sofa.",
            "a cat sleeps on a laptop computer on a couch"
        ]
    },
    {
        "id": 451843,
        "file_name": "COCO_train2014_000000451843.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000451843.jpg",
        "captions": [
            "A dog and a cat stand side by side",
            "An adorable cat sitting next to an adorable dog.",
            "A dog and cat sitting on the ground.",
            "a cat crouches menacingly along side a disinterested small dog",
            "Small little dog standing next to a smaller mixed colored cat."
        ]
    },
    {
        "id": 204138,
        "file_name": "COCO_train2014_000000204138.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000204138.jpg",
        "captions": [
            "Someone standing in a room with their shoes on their feet. ",
            "A man is wearing white tennis shoes on a tile floor.",
            "A striped cat stands at a person's feet on a tile floor.",
            "A man standing on a tiled floor with a cat next to him",
            "The camera person is wearing white tennis shoes out on the patio."
        ]
    },
    {
        "id": 530394,
        "file_name": "COCO_train2014_000000530394.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000530394.jpg",
        "captions": [
            "there is a black tuxedo cat looking in the mirror",
            "Two cats sitting on top of a wooden floor.",
            "A cat looking at itself in the mirror next to a tripod.",
            "A cat and a tripod sitting in front of a mirror.",
            "a close up of a cat in a mirror"
        ]
    },
    {
        "id": 390183,
        "file_name": "COCO_train2014_000000390183.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000390183.jpg",
        "captions": [
            "Two cats play with each other near some computers.",
            "Two mice, monitor screen and cat on the table",
            "A cat playing around on a computer desk near a TV and laptop. ",
            "A cat staring at the mouse for a computer.",
            "A cat is climbing on a book shelf looking at things."
        ]
    },
    {
        "id": 237286,
        "file_name": "COCO_train2014_000000237286.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000237286.jpg",
        "captions": [
            "One cat plays with a banana while another lies down on a rug.",
            "A cat playing with a banana toy as another cat looks on.",
            "A pair of cats play on a rug together.",
            "A couple of cats are playing on a rug",
            "Two cats laying on the floor playing with toys"
        ]
    },
    {
        "id": 260978,
        "file_name": "COCO_train2014_000000260978.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000260978.jpg",
        "captions": [
            "A cat is rolling around on a couch",
            "An orange cat lying on its side on a bed.",
            "A cat laying on a couch with a sheet and a remote on it.",
            "An orange cat on a sofa with a remote",
            "A cat upside on the couch near a remote"
        ]
    },
    {
        "id": 142601,
        "file_name": "COCO_train2014_000000142601.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000142601.jpg",
        "captions": [
            "One black cat and one orange cat sleeping on a bed near pillows.",
            "Two cats curled up on opposite sides of a bed.",
            "two cats one black the other a light brown sleeping on a bed",
            "A couple of cats are laying on a large bed.",
            "Cats sleeping on a quilted bed in a room."
        ]
    },
    {
        "id": 436014,
        "file_name": "COCO_train2014_000000436014.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000436014.jpg",
        "captions": [
            "A man using a laptop with cats sitting next to him on the table.",
            "Cats sit on a desk while a young man uses a laptop.",
            "A man on a laptop while two cats sit with him.",
            "A man uses his laptop while cats sit around his table.",
            "A man works on a computer white cats sit on the table."
        ]
    },
    {
        "id": 103447,
        "file_name": "COCO_train2014_000000103447.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000103447.jpg",
        "captions": [
            "A cat standing in a open suitcase on some cloths.",
            "A cat that is resting in a full bag of luggage.",
            "a cat lays inside of a suitcase with clothes in it ",
            "A cat standing in a laundry hamper looking down.",
            "An animal sitting in a suit case filled with clothing."
        ]
    },
    {
        "id": 372759,
        "file_name": "COCO_train2014_000000372759.jpg",
        "url": "http://images.cocodataset.org/train2014/COCO_train2014_000000372759.jpg",
        "captions": [
            "a black cat is hiding in a box with shoes",
            "A cat and some shoes side by side.",
            "There is a cat sitting next to a pair of boots.",
            "A cat sits among a pile of shoes in a confined space.",
            "A black cat peers at a bunch of black shoes."
        ]
    }
]