[
    {
        "id": 140360,
        "file_name": "COCO_train2014_000000140360.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000140360.jpg",
        "reference_caption": [
            "a black cat getting some water out of a bowl ",
            "A black cat drinking water from a bowl and his food bowl is next to it. ",
            "A cat that is standing near a bowl of water.",
            "A cat drinking water out of a water bowl.",
            "A cat standing by a bowl of water and food "
        ]
    },
    {
        "id": 154652,
        "file_name": "COCO_train2014_000000154652.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000154652.jpg",
        "reference_caption": [
            "A man smiling with his face near a cat",
            "A man smiles strangely with his head on top of a cat.",
            "A cat on a bed gets photobombed by its human.",
            "a cat laying on  the bed with a man laying his head next to him ",
            "A man with glasses leaning next to a cat."
        ]
    },
    {
        "id": 107982,
        "file_name": "COCO_train2014_000000107982.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000107982.jpg",
        "reference_caption": [
            "Black cat sits and stares atop of a television set. ",
            "A black cat that is sitting on a television.",
            "A close up of a black cat sitting on top of a television. ",
            "A black cat sitting on top of a TV.",
            "A black cat sitting next to a wall."
        ]
    },
    {
        "id": 301549,
        "file_name": "COCO_train2014_000000301549.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000301549.jpg",
        "reference_caption": [
            "A cat standing on a tiled floor next to an orange container.",
            "A cat looking down on a floor with white tiles.",
            "A cat looking at something on the floor",
            "A black and white cat is staring at the floor.",
            "A cat scanning the floor in front of an orange bucket"
        ]
    },
    {
        "id": 124926,
        "file_name": "COCO_train2014_000000124926.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000124926.jpg",
        "reference_caption": [
            "A cat sitting on a DVD player and looking at a screen with an owl on it.",
            "A cat is laying on a dvd player while watching a big owl on tv.",
            "a cat lying and watching an owl on the tv",
            "A cat sitting on a desk in front of a large image of an owl.",
            "A cat is laying on top of a  DVD player."
        ]
    },
    {
        "id": 23917,
        "file_name": "COCO_train2014_000000023917.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000023917.jpg",
        "reference_caption": [
            "A couple of animals that are sleeping together.",
            "a dog laying near smaller dogs and a cat",
            "A large brown dog laying next to two small white dogs and a cat.",
            "Some dogs and a cat are sleeping on a porch.",
            "Some animals sleeping on the front porch without any food to eat. "
        ]
    },
    {
        "id": 528018,
        "file_name": "COCO_train2014_000000528018.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000528018.jpg",
        "reference_caption": [
            "A man and his cat sit at a messy desk, surrounded by manuscript pages.",
            "A man at his desk surrounded by papers, holds his cat",
            "a woman and her cat sit at her computer desk",
            "A man that is sitting down with a cat.",
            "A man holding his cat in a room with papers spread out across the floor."
        ]
    },
    {
        "id": 459643,
        "file_name": "COCO_train2014_000000459643.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000459643.jpg",
        "reference_caption": [
            "A pair of cats relaxing on a sofa.",
            "Two cats snuggle with each other and snooze",
            "Two cats are snuggling on a fabric covered couch. ",
            "Two cats that are laying down next to each other.",
            "Two cats lie down with one sniffing the other's ear."
        ]
    },
    {
        "id": 479403,
        "file_name": "COCO_train2014_000000479403.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000479403.jpg",
        "reference_caption": [
            "A cat crawling into a black screen door.",
            "A grey and white cat climbing through a metal door.",
            "A grey cat climbing through the bars of a door.",
            "A cat with a long striped gray and black tail tries to enter a building through a gap in the door.",
            "a grey striped cat squeezing into a slab on a metal door."
        ]
    },
    {
        "id": 177763,
        "file_name": "COCO_train2014_000000177763.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000177763.jpg",
        "reference_caption": [
            " Cat on top of a suitcase looking at sow ting. ",
            "Two cats are crowded around a duffle bag.",
            "a cat on top of a luggage bag on the ground ",
            "Two cats hanging out with one sitting on luggage. ",
            "A black and white cat sits on top of a suitcase while another stands beside it."
        ]
    },
    {
        "id": 525716,
        "file_name": "COCO_train2014_000000525716.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000525716.jpg",
        "reference_caption": [
            "An orange cat sleeping on a couch with a mouse on top of it.",
            "Orange and white cat laying in a ball with a mouse on top.",
            "a close up of a cat laying on a couch with a computer mouse",
            "A computer mouse on top of the cat.",
            "A cat that is laying down with a mouse on top of it."
        ]
    },
    {
        "id": 470862,
        "file_name": "COCO_train2014_000000470862.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000470862.jpg",
        "reference_caption": [
            "A cat with a bewildered look lying inside a backpack.",
            "A cat sitting inside of a backpack with blankets around.",
            "A grey and white cat wrapped around a jacket.",
            "A cat is sitting inside a piece of luggage.  ",
            "A gray and white cat nestles inside a black suitcase."
        ]
    },
    {
        "id": 225557,
        "file_name": "COCO_train2014_000000225557.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000225557.jpg",
        "reference_caption": [
            " A circular disc on whichn front of a door. a cat and arrow are made is attached to a wall in front of a door.",
            "A cat graffiti painted over an arrow sign.",
            "A sign has an arrow and a cat on it.",
            "A funny sign on a wall indicating a nearby animal.",
            "a directional arrow sign with a picture of a cat"
        ]
    },
    {
        "id": 33938,
        "file_name": "COCO_train2014_000000033938.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000033938.jpg",
        "reference_caption": [
            "A grey and black cat laying on black suitcase.",
            "a cat is laying down on an empty traveling box\n",
            "A cat laying down on a suitcase on the floor in front of a bureau.",
            "A cat laying on a bag and staring upwards at the viewer.",
            "The cat is looking intently into the camera."
        ]
    },
    {
        "id": 579016,
        "file_name": "COCO_train2014_000000579016.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000579016.jpg",
        "reference_caption": [
            "A car lying on the top of a car on a town street.",
            "A cat laying on its side near some street signs",
            "A cat is laying on top of something on the side of the road.",
            "A light orange cat lays on a shiny surface. ",
            "A cat sitting on top of a car."
        ]
    },
    {
        "id": 509115,
        "file_name": "COCO_train2014_000000509115.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000509115.jpg",
        "reference_caption": [
            "A cat lounging on the couch with a game remote control.",
            "A black and white cat is shown lounging on a couch.",
            "A cat rests on a couch near video game remotes controllers",
            "A cat laying on a couch near a remote control. ",
            "A cat laying on a couch with a remote."
        ]
    },
    {
        "id": 324483,
        "file_name": "COCO_train2014_000000324483.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000324483.jpg",
        "reference_caption": [
            "A fluffy cat is poking its head out from a suitcase.",
            "A cat with long hair standing inside of a bag.",
            "An alert cat sitting inside a bag looking to his right.",
            "A cat peaking out of an open suitcase.",
            "a cat sitting and facing to the left of the camera."
        ]
    },
    {
        "id": 258499,
        "file_name": "COCO_train2014_000000258499.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000258499.jpg",
        "reference_caption": [
            "A cat is seated while he wears a collar and tie.",
            "A cat that is sitting down wearing a tie.",
            "a cat dressed with a collar and tie decorated with irish symbols",
            "Gray cat wearing white collar and green tie sitting in room.",
            "This is a cat wearing an Irish themed tie."
        ]
    },
    {
        "id": 237505,
        "file_name": "COCO_train2014_000000237505.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000237505.jpg",
        "reference_caption": [
            "A fat orange and white cat laying on a bed.",
            "A cat sleeping on a quilt on a bed.",
            "a lazy cat is laying across a bed ",
            "A cat is laying on a quilt on a bed.",
            "A cat laying down on a bed in a room."
        ]
    },
    {
        "id": 145891,
        "file_name": "COCO_train2014_000000145891.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000145891.jpg",
        "reference_caption": [
            "A black cat laying on top of a white bed.",
            "a black cat seated on a well made bed gazing",
            "A dark colored cat laying down on a big bed.",
            "A cat laying on a bed with the window in front of it.",
            "A cat lying on a bed in a dark room "
        ]
    },
    {
        "id": 86925,
        "file_name": "COCO_train2014_000000086925.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000086925.jpg",
        "reference_caption": [
            "The cat is sitting on the toilet in the bathroom. ",
            "a brown cat sitting on a toilet lid in the bathroom ",
            "A cat is sitting on top of a toilet seat.",
            "A cat sitting on a covered toilet lid.",
            "a black and  brown cat is sitting on a toilet "
        ]
    },
    {
        "id": 445680,
        "file_name": "COCO_train2014_000000445680.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000445680.jpg",
        "reference_caption": [
            "The cat is laying directly on top of the laptop.",
            "A cat on a bed laying on top of a laptop.",
            "A cat laying on top of a laptop computer on a bed.",
            "A cat laying on a laptop keyboard on a bed.",
            "Cat sprawled across a laptop on a bed."
        ]
    },
    {
        "id": 138161,
        "file_name": "COCO_train2014_000000138161.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000138161.jpg",
        "reference_caption": [
            "A large cat laying on top of a computer keyboard.",
            "an image of a cat resting on a keyboard",
            "A tired cat with it's head resting on a keyboard.",
            "A cat is in a dimly lit room on a keyboard.",
            "A cat leaning its head on the keyboard of a computer"
        ]
    },
    {
        "id": 47563,
        "file_name": "COCO_train2014_000000047563.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000047563.jpg",
        "reference_caption": [
            "One cat sits by the umbrella and the other sits.under it.",
            "Two cats are outside with one under the umbrella",
            "Two cats in a drive one sitting while the other is sitting under a umbrella.",
            "A cat sits on the driveway next to a cat under an umbrella.",
            "a cat sitting under an umbrella in a driveway "
        ]
    },
    {
        "id": 114776,
        "file_name": "COCO_train2014_000000114776.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000114776.jpg",
        "reference_caption": [
            "A beige car sits outside of a house.",
            "Old muscle car sitting out in the front yard",
            "An old, light colored Mustang parked outside of a house.",
            "A car parked in front of a house.",
            "A tan muscle car sits outside a home on a gravel drive."
        ]
    },
    {
        "id": 467333,
        "file_name": "COCO_train2014_000000467333.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000467333.jpg",
        "reference_caption": [
            "A fluffy cat laying on the arm of a couch.",
            "A black and white photo of a cat with a remote control.",
            "A cat is laying on the couch arm by a remote control.",
            "A cat is sitting on the arm of a chair with a remote.",
            "A cat sitting on a couch arm next to a remote control."
        ]
    },
    {
        "id": 318089,
        "file_name": "COCO_train2014_000000318089.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000318089.jpg",
        "reference_caption": [
            "A cat lays down around some stuffed animals.",
            "A cat laying on a towel next to two stuffed toys.",
            "A cat is on a bed with some stuffed animals.",
            "A small cat sleeping on a bed with teddy bears.",
            "Two stuffed animals give a white cat some company."
        ]
    },
    {
        "id": 536923,
        "file_name": "COCO_train2014_000000536923.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000536923.jpg",
        "reference_caption": [
            "People are in a room with two beds and a microwave.",
            "A woman looking over her should while standing next to a woman in bed.",
            "A woman standing in a room near another woman lying on a bed.",
            "a person laying in a bed with anther person standing",
            "Two young women chilling in a hotel room."
        ]
    },
    {
        "id": 374561,
        "file_name": "COCO_train2014_000000374561.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000374561.jpg",
        "reference_caption": [
            "A cat with a surprised expression and a mouse in its mouth.",
            "A cat is in a bathroom holding a mouse in its mouth.",
            "A cat that is on the ground in a bathroom.",
            "A kitten is peeking out with a mouse in it's mouth.",
            "A cat has a mouse in his mouth."
        ]
    },
    {
        "id": 342203,
        "file_name": "COCO_train2014_000000342203.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000342203.jpg",
        "reference_caption": [
            "A cat with a serious look on its face by a laptop and coffee cup.",
            "A kitten standing next to a laptop and a coffee cup.",
            "Young kitten near coffee mug looking at counter top.",
            "A small cat standing in front of a coffee mug.",
            "The black and white cat is going to inspect the cup."
        ]
    },
    {
        "id": 469197,
        "file_name": "COCO_train2014_000000469197.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000469197.jpg",
        "reference_caption": [
            "A rail bridge next to tall building with a train on it.",
            "A cat in a grassy field with a train passing by on bridge.",
            "Public transportation train on a large sized bridge.",
            "A train going over a bridge with some buildings in the background",
            "There is an elevated railway above an empty field."
        ]
    },
    {
        "id": 532617,
        "file_name": "COCO_train2014_000000532617.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000532617.jpg",
        "reference_caption": [
            "A man standing in a garden with a small white dog and gray cat.",
            "A person with cats checking on vegetables that are growing",
            "A person and some animals that are by some plants.",
            "two cats in a garden sniffing plants with a person",
            "A man and two cats standing on a porch with a lot of potted plants."
        ]
    },
    {
        "id": 172096,
        "file_name": "COCO_train2014_000000172096.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000172096.jpg",
        "reference_caption": [
            "A long haired black cat is looking out a window.",
            "A CAT WATCHES A BIRD AT THE WINDOW IN THE SNOW",
            "A black cat staring at a bird through a window.",
            "The large cat is looking out of a window.",
            "A cat looking out a window at a bird."
        ]
    },
    {
        "id": 578108,
        "file_name": "COCO_train2014_000000578108.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000578108.jpg",
        "reference_caption": [
            "Two cats sitting on a green towel inside of a bathroom.",
            "Two cats sit on top of a towel on a counter.",
            "Two cats sitting next to each other on a sink in the bathroom. ",
            "Two cats lying down next to a sink in the bathroom. ",
            "A pair of cats resting on a small rug on a counter in a bathroom next to a sink."
        ]
    },
    {
        "id": 445491,
        "file_name": "COCO_train2014_000000445491.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000445491.jpg",
        "reference_caption": [
            "A pet shop having a reptile sale on may16.",
            "A sign advertising a reptile sale in May",
            "A sign saying \"REPTILE SALE - Cow Palace\" is displayed.",
            "a sign in front of two trees and wood in the background",
            "A sale sign placed in front of an exhibit with trees."
        ]
    },
    {
        "id": 309580,
        "file_name": "COCO_train2014_000000309580.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000309580.jpg",
        "reference_caption": [
            "A cat sitting in front of a silver TV in a living room.",
            "a cat watches interested in what's on the television",
            "A cat is sitting on the floor watching television.",
            "A cat sitting on the ground looking up at a television.",
            "a cat that is watching a t.v. screen"
        ]
    },
    {
        "id": 336075,
        "file_name": "COCO_train2014_000000336075.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000336075.jpg",
        "reference_caption": [
            "A living room with blue furniture and a flat screen TV.",
            "A lone man sits on a living room couch with a laptop while watching TV.",
            "A man sitting on a couch with a laptop in a living room.",
            "A person sitting the couch with a laptop in a living room.",
            "A living scene is depicted with a man sitting on a couch."
        ]
    },
    {
        "id": 233435,
        "file_name": "COCO_train2014_000000233435.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000233435.jpg",
        "reference_caption": [
            "A woman is watching her cats play outside",
            "A cat standing on top of a red brick wall near a bush.",
            "A woman's head sticking out of a window.",
            "A cat standing on a brick ledge, with a woman behind her.",
            "A cat that is on top of a brick wall."
        ]
    },
    {
        "id": 199251,
        "file_name": "COCO_train2014_000000199251.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000199251.jpg",
        "reference_caption": [
            "A tiger cat walking across a field. near plants.",
            "A gray tiger kitten playing outside in the dirt.",
            "A photo of a cat from the back side.",
            "a cat that is sitting on the ground",
            "The black and grey cat is facing the other way"
        ]
    },
    {
        "id": 119115,
        "file_name": "COCO_train2014_000000119115.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000119115.jpg",
        "reference_caption": [
            "A cat attempts to grab the image on a television screen.",
            "a llittle black and white cat playing with a tv screen ",
            "A black and white cat holds his paw up to a television set.",
            "A cat trying to catch a cartoon character on television.",
            "A cat that is looking at a tv."
        ]
    },
    {
        "id": 378087,
        "file_name": "COCO_train2014_000000378087.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000378087.jpg",
        "reference_caption": [
            "A large gray dog sitting on top of a bed next to a cat.",
            "A cat sniffs a dog lying on a blanket in front of an entertainment table.",
            "a cat standing next to a dog both in front of a desk with a monitor on it.",
            "Two animals sit on top of blanket by a TV.",
            "a cat biting a dog in front of the television."
        ]
    },
    {
        "id": 437857,
        "file_name": "COCO_train2014_000000437857.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000437857.jpg",
        "reference_caption": [
            "A pizza sitting inside of a card board box.",
            "A blurry picture of a pizza inside a box.",
            "The cat is keeping his eyes on the pizza in a box.",
            "A cat looks at a pizza in a pizza box. ",
            "A cat seems to be eye-balling a full pizza. "
        ]
    },
    {
        "id": 12307,
        "file_name": "COCO_train2014_000000012307.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000012307.jpg",
        "reference_caption": [
            "Two cats sitting on top of a window sill near curtains.",
            "Two cats sitting in a window seal beside a picture frame and vase. ",
            "two cats sitting in a open window with peaches on the curtains.",
            "Two cats sit in an open window with open shutters.",
            "Two black cats are looking out the window."
        ]
    },
    {
        "id": 378272,
        "file_name": "COCO_train2014_000000378272.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000378272.jpg",
        "reference_caption": [
            "A sheep chasing a cat through a flower and grass covered field.",
            "a sheep and a cat running towards a bush in a field",
            "A sheep chases a cat towards a small hedge.",
            "A sheep chasing a cat through a field.",
            "A small dog herds sheep in a pasture."
        ]
    },
    {
        "id": 423717,
        "file_name": "COCO_train2014_000000423717.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000423717.jpg",
        "reference_caption": [
            "A cat climbing down beside a t.v. screen. ",
            "A cat is coming from behind a small white television.",
            "The cat walks on a table beside a small television.",
            "There is a big room with furniture and items inside. \n",
            "A cat standing on a table next to a television with a cat on the screen."
        ]
    },
    {
        "id": 359656,
        "file_name": "COCO_train2014_000000359656.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000359656.jpg",
        "reference_caption": [
            "A cat ays on the floor in an office.",
            "A computer desk with a computer and laptop on top of it.",
            "a cat laying in a room on some carpet ",
            "this is a cat laying on the carpet at home",
            "A cat is sitting on the floor in a room with a couch, desk, and computer in it."
        ]
    },
    {
        "id": 283818,
        "file_name": "COCO_train2014_000000283818.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000283818.jpg",
        "reference_caption": [
            "A calico cat sits on top of a refrigerator in a kitchen.",
            "A cat sitting on top of a refrigerator.",
            "A cat is sitting on top of a refrigerator",
            "A cat perched on top of a refrigerator.",
            "A cat is sitting on top of the refrigerator."
        ]
    },
    {
        "id": 294108,
        "file_name": "COCO_train2014_000000294108.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000294108.jpg",
        "reference_caption": [
            "A cat is shown underneath a pile of clothes.",
            "A cat lying on a pair of pants on a bed with a shirt thrown over it",
            "A cat sleeping on a bed covered in clothes.",
            "a cat laying in a bed with clothes",
            "A cat lying on the bed amongst a bunch of clothes "
        ]
    },
    {
        "id": 149143,
        "file_name": "COCO_train2014_000000149143.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000149143.jpg",
        "reference_caption": [
            "a black cat is lying on a black shoe and a rug",
            "A black cat laying next to a black shoe.",
            "A black cat curled up to a shoe on a rug.",
            "There is a black cat curled up next to a shoe.",
            "a cat is laying down by someones shoe"
        ]
    },
    {
        "id": 179725,
        "file_name": "COCO_train2014_000000179725.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000179725.jpg",
        "reference_caption": [
            "Two photographs of a white and grey cat with dog.",
            "A cat lying down near the remote controller.",
            "A cat is laying on a table with a remote.",
            "Two pictures shows a cat and dog lying around on a couch.",
            "a white cat laying down on a table by a remote "
        ]
    },
    {
        "id": 63572,
        "file_name": "COCO_train2014_000000063572.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000063572.jpg",
        "reference_caption": [
            "two cats are eating food out of a plate",
            "Cats in a carpeted room sharing a bowl of cat food.",
            "A calico cat and an orange tabby cat are next to a blue bowl filled with cat food.",
            "Two cats are eating out of one bowl of food.",
            "Two cats are eating next to each other out of the same bowl."
        ]
    },
    {
        "id": 335633,
        "file_name": "COCO_train2014_000000335633.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000335633.jpg",
        "reference_caption": [
            "A woman is playing with a cat while sitting at the dinner table.",
            "Woman with cat at dinner outside eating fruit, bread and wine.",
            "A woman has a cat at a dining room table.",
            "A woman sitting at a table with a glass of wine.",
            "A woman holds a cat at a table outside of a restaurant."
        ]
    },
    {
        "id": 78342,
        "file_name": "COCO_train2014_000000078342.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000078342.jpg",
        "reference_caption": [
            "A cat laying on a keyboard on a table",
            "A orange cat laying on top of a computer keyboard.",
            "A cat laying on a desk with its heat resting on a keyboard.",
            "A cat that is laying on a keyboard.",
            "A cat laying on a keyboard on an office desk."
        ]
    },
    {
        "id": 126321,
        "file_name": "COCO_train2014_000000126321.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000126321.jpg",
        "reference_caption": [
            "Black and white photograph of a cat in a window.",
            "A tabby cat sitting on a window sill.",
            "A black cat is sitting in a window sill.",
            "A black cat with white chin sitting on a windowsill looking out.",
            "A cat sits in an old window sill snoozing"
        ]
    },
    {
        "id": 468951,
        "file_name": "COCO_train2014_000000468951.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000468951.jpg",
        "reference_caption": [
            "A black and white cat sticking its head over black luggage.",
            "Unzipped suitcase on floor with cat peeking out of compartment.",
            "A black suitcase with a cat peeking outside of it. ",
            "A cat hiding in a black luggage case.",
            "a close up of a cat on a luggage bag"
        ]
    },
    {
        "id": 46024,
        "file_name": "COCO_train2014_000000046024.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000046024.jpg",
        "reference_caption": [
            "A computer desk with a cat standing on top of it next to a monitor.",
            "A cat taking a walk across the computer desk.",
            "A cat is walking on a desk with a computer monitor on it.",
            "A cat stands on a desk by a computer monitor.",
            "a gray and white cat on a desk a chair and monitor"
        ]
    },
    {
        "id": 411485,
        "file_name": "COCO_train2014_000000411485.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000411485.jpg",
        "reference_caption": [
            "A cat sits on top of a couch.",
            "A grey cat laying on a sofa covered in throw pillows.",
            "A cat sits on top of a couch with pillows.",
            "a cat on a couch with a lot of pillows",
            "The grey cat is lying on the couch."
        ]
    },
    {
        "id": 555427,
        "file_name": "COCO_train2014_000000555427.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000555427.jpg",
        "reference_caption": [
            "Cat asleep on bed next to empty soda bottle.",
            "A fluffy cat is sleeping next to an empty diet Snapple bottle.",
            "A black cat has it's paw in a Snapple bottle.",
            "A black cat with its paw in a snapple bottle.",
            "A furry animal next to an empty iced tea bottle."
        ]
    },
    {
        "id": 558467,
        "file_name": "COCO_train2014_000000558467.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000558467.jpg",
        "reference_caption": [
            "A cat is laying on the floor beside a suitcase and staring upward with its mouth open.",
            "a fat cat laying on a towel next to a chair",
            "A cat laying in the floor on a blue towel.",
            "A cat lying on a blue towel looks up at the camera.",
            "a cat layind down by a chair looking into a camera"
        ]
    },
    {
        "id": 524340,
        "file_name": "COCO_train2014_000000524340.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000524340.jpg",
        "reference_caption": [
            "A cat straddling the arm of a couch with another one lying on the back of the couch ",
            "Two cats laying on top of a stuffed chair",
            "a large orange and white cat sleeping on the arm of a couch",
            "Two cats, one sitting on the arm of a couch, the other on the back .",
            "Two cats are lounging around on the back of the furniture."
        ]
    },
    {
        "id": 19987,
        "file_name": "COCO_train2014_000000019987.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000019987.jpg",
        "reference_caption": [
            "A cat stares away as a movie plays on a large screen TV.",
            "A cat looking at the camera with a funny expression.",
            "This is a picture of a cat looking forward.",
            "A cat starring at you, and a HD TV in the background.",
            "A concerned cat sits in front of a television displaying a blurry image."
        ]
    },
    {
        "id": 524594,
        "file_name": "COCO_train2014_000000524594.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000524594.jpg",
        "reference_caption": [
            "A dog wearing a sweater  next to a cat.",
            "A dog and a cat sitting together calmly.",
            "An adorable little dog and cat get petted by their owner.",
            "A dog and cat sitting side by side.",
            "A dog wearing a sweater and a cat being touched by a hand."
        ]
    },
    {
        "id": 206255,
        "file_name": "COCO_train2014_000000206255.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000206255.jpg",
        "reference_caption": [
            "a white cat next to a toy car",
            "A cat sitting down on a blanket near a toy VW.",
            "White cat sitting on a white blanket near a yellow toy car.",
            "A cat playing with a yellow car on a blanket.",
            "A very cute cat on a bed with a toy car."
        ]
    },
    {
        "id": 122726,
        "file_name": "COCO_train2014_000000122726.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000122726.jpg",
        "reference_caption": [
            "A black and white photo of a cat sitting on a bench.",
            "A cat gazes into the camera while sitting on a bench.",
            "A fat cat sitting on a wooden bench.  ",
            "A black and white photo of a cat sitting on a bench.",
            "A gray tiger stripe cat sitting on top of a wooden bench."
        ]
    },
    {
        "id": 88082,
        "file_name": "COCO_train2014_000000088082.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000088082.jpg",
        "reference_caption": [
            "A black cat laying in a wooden dining chair.",
            "A black cat is sitting on a chair",
            "A black cat sits in a chair in the house. ",
            "A black cat laying in a wooden rocking chair.",
            "A black cat lying on a painted wooden captain's chair."
        ]
    },
    {
        "id": 408116,
        "file_name": "COCO_train2014_000000408116.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000408116.jpg",
        "reference_caption": [
            "there is a gray cat that is laying on a blue bag",
            "A cat relaxes on top of a bag.",
            "a grey cat on a blue bag gazing",
            "THERE IS A HEALTHY ADULT CAT SITTING IN A SUIT CASE ",
            "A gray cat is sitting in a blue suitcase."
        ]
    },
    {
        "id": 4622,
        "file_name": "COCO_train2014_000000004622.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000004622.jpg",
        "reference_caption": [
            "A cat laying on a table next to bottle with a fish in it. ",
            "A cat lying on a sofa table in a living room ",
            "A very cute cat laying on a long table.",
            "A cat is laying on a wooden table.",
            "A cat laying on a table in a room."
        ]
    },
    {
        "id": 36523,
        "file_name": "COCO_train2014_000000036523.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000036523.jpg",
        "reference_caption": [
            "A kitten licking itself while surfing the computer.",
            "Kitten sitting on a bed in in front of a laptop, with one paw touching the laptop.",
            "A little kitty on the bed using a laptop.",
            "A cat is sitting on the bed with it's paw on a laptop keyboard.",
            "A kitty cat, sitting on a blanket, surfs the web."
        ]
    },
    {
        "id": 487851,
        "file_name": "COCO_train2014_000000487851.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000487851.jpg",
        "reference_caption": [
            "An orange ball and a black cats head under a yellow umbrella.",
            "A cat that is under a yellow umbrella.",
            "A cat looking up while underneath a yellow umbrella. ",
            "a small cat is under a yellow umbrella on th floor",
            "A black cat is attacking a yellow umbrella. "
        ]
    },
    {
        "id": 354258,
        "file_name": "COCO_train2014_000000354258.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000354258.jpg",
        "reference_caption": [
            "A picture of a cat playing with piece of string.",
            "A photo of a cat licking a pencil.",
            "A black and white cat licking some type of item.",
            "A black and white cat is licking a stick.",
            "a cat is licking something that is yellow"
        ]
    },
    {
        "id": 453538,
        "file_name": "COCO_train2014_000000453538.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000453538.jpg",
        "reference_caption": [
            "A black and white image of a cat next to a laptop",
            "A cat that is sitting next to a laptop.",
            "the kitten is sitting in the nook on the mouse.",
            "Cat next to a laptop on counter top looking intrigued.",
            "A cat sitting on top of a desk."
        ]
    },
    {
        "id": 536067,
        "file_name": "COCO_train2014_000000536067.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000536067.jpg",
        "reference_caption": [
            "A cat drinking water from a wine glass ",
            "A cat drinking water out of a wine glass.",
            "A grey and white cat drinking from a wine glass filled with water",
            "A cat drinking the water from a wine glass.",
            "A cat has his face in a wine glass filled with water."
        ]
    },
    {
        "id": 418853,
        "file_name": "COCO_train2014_000000418853.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000418853.jpg",
        "reference_caption": [
            "A cat peeking into a window standing next to a trash bag.",
            "A cat looking through a curved  glass door.",
            "Cat next to a trash bag looking through a window.",
            "a black brown and white cat looking through a window",
            "A cat is seen sitting next to a bag through a small window."
        ]
    },
    {
        "id": 159118,
        "file_name": "COCO_train2014_000000159118.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000159118.jpg",
        "reference_caption": [
            "A cat that is laying on top of a suitcase.",
            "A cat that is laying down in a suitcase.",
            "A cat sitting in its bed on the ground.",
            "A long haired tabby cat laying on top of a black suitcase. ",
            "A cat sitting on a suitcase with a lethargic look."
        ]
    },
    {
        "id": 497616,
        "file_name": "COCO_train2014_000000497616.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000497616.jpg",
        "reference_caption": [
            "A black and white photo of a cat sitting on a chair.",
            "a black and white photo of a cat using an old photo camera ",
            "A cat comically taking an old fashioned picture of another cat.",
            "A cat sitting in a chair near another cat that is holding on to something with his paw",
            "a vintage photo of a cat taking a picture of another cat"
        ]
    },
    {
        "id": 367515,
        "file_name": "COCO_train2014_000000367515.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000367515.jpg",
        "reference_caption": [
            "cat using toilet instead of his cat box",
            "A cat perches on and uses the toilet.  ",
            "A cat sits on a toilet and looks like it is going to the bathroom in the toilet. ",
            "A black cat sitting on top of a white toilet.",
            "A cat sitting on the edge of a toilet looking under a sink."
        ]
    },
    {
        "id": 433125,
        "file_name": "COCO_train2014_000000433125.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000433125.jpg",
        "reference_caption": [
            "A cat is watching the animal planet channel on a television.",
            "A gray and white cat is watching tv.",
            "a small cat watches a cheetah run on television ",
            "A kitten sitting in front of a television on a shelf.",
            "A cat sits close in front of a television with a cheetah on it. "
        ]
    },
    {
        "id": 539008,
        "file_name": "COCO_train2014_000000539008.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000539008.jpg",
        "reference_caption": [
            "Two cats sleeping on a messy bed in the bedroom.",
            "Two cats lying on someone's dirty unmade bed",
            "Sleeping person on bed with black cat at noon",
            "two cats laying in a messy bed near a wall",
            "There are two cats laying on the same bed together"
        ]
    },
    {
        "id": 279479,
        "file_name": "COCO_train2014_000000279479.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000279479.jpg",
        "reference_caption": [
            "A cat is sniffing a laptop that is open.",
            "A large orange cat sitting next to a laptop computer.",
            "A cat is looking at the side of a laptop computer.",
            "A cat is sitting next to a laptop",
            "A cat on a desk sniffing a laptop computer."
        ]
    },
    {
        "id": 53479,
        "file_name": "COCO_train2014_000000053479.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000053479.jpg",
        "reference_caption": [
            "A cat laying on top of a laptop computer.",
            "A cat laying on a laptop keyboard sitting on a desk.",
            "A cat laying on top of a laptop.",
            "a cat sitting on top of someones laptop.",
            "Cat lying on laptop set upon a workspace."
        ]
    },
    {
        "id": 22451,
        "file_name": "COCO_train2014_000000022451.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000022451.jpg",
        "reference_caption": [
            "A person holding a black kitten and a remote control.",
            "A man holding a cat with his TV remote and a soda on his lap.",
            "a can a black cat and a person in a blue shirt",
            "A can of soda and a TV remote lying on a cat that is sitting next to a person.",
            "A kitty with a human, channel changer and juice can."
        ]
    },
    {
        "id": 183537,
        "file_name": "COCO_train2014_000000183537.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000183537.jpg",
        "reference_caption": [
            "A kitten sitting on the keyboard of a laptop.",
            "A cat sitting on top of a laptop computer keyboard.",
            "A kitten sitting on a laptop computer's keyboard.",
            "A cat that is sitting on top of a keyboard.",
            "A kitten sits on the keyboard of a laptop computer."
        ]
    },
    {
        "id": 259146,
        "file_name": "COCO_train2014_000000259146.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000259146.jpg",
        "reference_caption": [
            "A cat sitting on top of a ledge near a window.",
            "a grey cat staring silted  at window",
            "A cat is looking out the window with a chandelier in the background.",
            "A cat is looking out of a window",
            "A cat with a suspenseful look sitting on a window seal."
        ]
    },
    {
        "id": 429460,
        "file_name": "COCO_train2014_000000429460.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000429460.jpg",
        "reference_caption": [
            "A close up of a cat wearing read bunny ears.",
            "A cat is lying on a blanket with a red knit costume piece around its head.",
            "A gray cat is wearing a red knitted rabbit hat cozy.",
            "A cat is wearing a small knit red hat.",
            "A cat wearing a bunny hat is relaxing on a blanket."
        ]
    },
    {
        "id": 304832,
        "file_name": "COCO_train2014_000000304832.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000304832.jpg",
        "reference_caption": [
            "A black and white cat looking at its reflection in the mirror.",
            "A little cat looks at its reflection in a mirror. ",
            "A black and white cat bats at its reflection in a mirror.",
            "A cat sitting in front of a mirror looking at its reflection.",
            "A black and white cat sitting in front of a mirror."
        ]
    },
    {
        "id": 78339,
        "file_name": "COCO_train2014_000000078339.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000078339.jpg",
        "reference_caption": [
            "this is a cat sitting on a brown carpet",
            "A gray tabby cat sitting on a chair.",
            "a cat that is sitting on a big chair",
            "A cat is laying on a wooden chair.",
            "a striped cat sitting in a brown chair"
        ]
    },
    {
        "id": 233379,
        "file_name": "COCO_train2014_000000233379.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000233379.jpg",
        "reference_caption": [
            "A grey cat with green eyes looking straight ahead.",
            "A black cat with green eyes looking mad.",
            "A black cat with yellow eyes sits in a blue chair.",
            "A black cat staring and sitting on a chair.",
            "A grey cat with green eyes and a pensive look on its face."
        ]
    },
    {
        "id": 425914,
        "file_name": "COCO_train2014_000000425914.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000425914.jpg",
        "reference_caption": [
            "A couple of cats sleeping on top of a couch.",
            "a couple of cats sit on top of a pillow ",
            "A black and white cat curled up on a brown checked sofa.",
            "Two cats laying together on pillows of a couch.",
            "A cat is sleeping on a couch with pillows."
        ]
    },
    {
        "id": 510320,
        "file_name": "COCO_train2014_000000510320.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000510320.jpg",
        "reference_caption": [
            "A desk topped with clutter and next to a chair.",
            "A desk and chair in a small room.",
            "A desk with various papers and folders on it next to a poster of a cat.",
            "A messy office with a poster reading \"Give Up\" on a wall.",
            "An office of someone who has plenty of desks yet still could use more. "
        ]
    },
    {
        "id": 280177,
        "file_name": "COCO_train2014_000000280177.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000280177.jpg",
        "reference_caption": [
            "A black cat sitting on a table next to a bowl of chicken soup.",
            "A black cat sitting on the table with a bowl of chicken noodle soup.",
            "A black cat sitting on a table near some soup",
            "A black cat sitting in front of a bowl of chicken noodle soup on a table.",
            "A cat sitting on the table with a small cup and a bowl of soup."
        ]
    },
    {
        "id": 203179,
        "file_name": "COCO_train2014_000000203179.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000203179.jpg",
        "reference_caption": [
            "A person holding a white cup with a kitten inside of it.",
            "A very small and cute kitten in a cup.",
            "Adult holding cup with small tiger striped kitten.",
            "A small kitten sits in a small cup.",
            "a close up of a person holding a kitten in a cup"
        ]
    },
    {
        "id": 93257,
        "file_name": "COCO_train2014_000000093257.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000093257.jpg",
        "reference_caption": [
            "Black and white cat with black nose laying on bedspread.",
            "A black and white cat curled up on a floral quilt. ",
            "A cat sits on the bed and looks at something.",
            "A black and white cat is lying down while looking up.",
            "A black and white cat sitting on a bed comforter."
        ]
    },
    {
        "id": 578005,
        "file_name": "COCO_train2014_000000578005.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000578005.jpg",
        "reference_caption": [
            "A kitchen filled with white appliances and wooden cabinets.",
            "A cluttered kitchen with cats laying on top of the cabinets. ",
            "Side few of someones kitchen a refrigerator with many pictures on it  ,",
            "Two cats sitting on top of kitchen cabinets.",
            "Two cats sit on the cabinets above a cluttered refrigerator.  "
        ]
    },
    {
        "id": 171239,
        "file_name": "COCO_train2014_000000171239.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000171239.jpg",
        "reference_caption": [
            "A women on a bed looking at a kitten.",
            "Three dimensional image of woman and cat laying on a bed.",
            "The 3D image shows a girl lying on a bed with a cat.",
            "Computer generated artwork of a girl and cat in a bedroom",
            "a woman laying on the bed in her underwear looking at a black and white cat"
        ]
    },
    {
        "id": 3729,
        "file_name": "COCO_train2014_000000003729.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000003729.jpg",
        "reference_caption": [
            "A tail of a cat hanging on the outside of a suitcase. ",
            "A black cat tail sticking out of a burgundy suitcase/",
            "The tail of an animal pokes out from a suitcase.",
            "A red piece of luggage sitting on top of a bed.",
            "THERE IS A SUTCASE THAT IS ON THE BED "
        ]
    },
    {
        "id": 160900,
        "file_name": "COCO_train2014_000000160900.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000160900.jpg",
        "reference_caption": [
            "a black cat laying on a round rug in a bathroom",
            "a black cat is standing on a round white rug",
            "A cat curled up on the floor of a bathroom.",
            "A cat is crouched on a bathroom rug looking toward a hidden litterbox.",
            "a cat in a bathroom on the ground next to a bath tub"
        ]
    },
    {
        "id": 118889,
        "file_name": "COCO_train2014_000000118889.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000118889.jpg",
        "reference_caption": [
            "A cat is perched on a closed toilet.",
            "a black gray and white cat sitting on a toilet seat",
            "A cat sitting on top of a pile of white plates.",
            "Grey and white cat sitting on commode in tiled bathroom area.",
            "a cat crouches on top of a toilet. "
        ]
    },
    {
        "id": 222929,
        "file_name": "COCO_train2014_000000222929.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000222929.jpg",
        "reference_caption": [
            "Cat sitting on a small police car in a residential neighborhood",
            "Black and white cat on the hood of a police car parked on a street.",
            "A police car sitting parked in front of two houses..",
            "A police car is parked on the curb of a suburban neighborhood.",
            "A street scene with a police car parked on the side of the road."
        ]
    },
    {
        "id": 322121,
        "file_name": "COCO_train2014_000000322121.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000322121.jpg",
        "reference_caption": [
            "A hairless cat with a face inside a bowl of food.",
            "The cat knew immediately that Sushi was at the table.",
            "A sphinx cat sniffs a bowl on a table.",
            "a little siamese cat looking into a bowl on the table",
            "a cat is standing on a wood table"
        ]
    },
    {
        "id": 430818,
        "file_name": "COCO_train2014_000000430818.jpg",
        "img_url": "http://images.cocodataset.org/train2014/COCO_train2014_000000430818.jpg",
        "reference_caption": [
            "Evil looking cat eyes are penetrating and mesmerizing.",
            "Cat playing with a tennis shoe near a wall. ",
            "A cat hugging a pair of shoes on top of the floor.",
            "there is a cat that is laying next to a shoe",
            "A cat resting beside a hiking boot with one paw on the boot."
        ]
    }
]